neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H7.c

#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <math.h>
#include <time.h>

#include "soc.h"

#include "DMA/DMA.h"

#include "NeonRTOS.h"

#ifdef STM32H7

#include "DMA_STM32_Index.h"

#include "DMA_STM32.h"

//#include "CAN/Device/STM32/CAN_STM32.h"
#include "I2C/Device/STM32/I2C_Master_STM32.h"
#include "SPI/Device/STM32/SPI_Master_STM32.h"
#include "UART/Device/STM32/UART_STM32.h"

#define DMA_STREAM_LOCK(stream_index) if (NeonRTOS_LockObjLock(&DMA_Stream_Mutex[(stream_index)], DMA_WAIT_ALLOCATED_TIMEOUT) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }
#define DMA_STREAM_UNLOCK(stream_index) if (NeonRTOS_LockObjUnlock(&DMA_Stream_Mutex[(stream_index)]) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }

static const hwDMA_Stream_Index UART_DMA_Channel_Map[hwUART_Index_MAX][hwDMA_Peripheral_Direction_MAX] = {
#if defined (UART1_BASE) || defined(USART1_BASE)
        {hwDMA_Stream_Index_0, hwDMA_Stream_Index_1},
#endif
#if defined (UART2_BASE) || defined(USART2_BASE)
        {hwDMA_Stream_Index_2, hwDMA_Stream_Index_3},
#endif
#if defined (UART3_BASE) || defined(USART3_BASE)
        {hwDMA_Stream_Index_4, hwDMA_Stream_Index_5},
#endif
#if defined (UART4_BASE) || defined(USART4_BASE)
        {hwDMA_Stream_Index_6, hwDMA_Stream_Index_7},
#endif
#if defined (UART5_BASE) || defined(USART5_BASE)
        {hwDMA_Stream_Index_8, hwDMA_Stream_Index_9},
#endif
#if defined (UART6_BASE) || defined(USART6_BASE)
        {hwDMA_Stream_Index_10, hwDMA_Stream_Index_11},
#endif
#if defined (UART7_BASE) || defined(USART7_BASE)
        {hwDMA_Stream_Index_12, hwDMA_Stream_Index_13},
#endif
#if defined (UART8_BASE) || defined(USART8_BASE)
        {hwDMA_Stream_Index_14, hwDMA_Stream_Index_15},
#endif
#if defined (UART9_BASE) || defined(USART9_BASE)
        {hwDMA_Stream_Index_0, hwDMA_Stream_Index_1},
#endif
#if defined (UART10_BASE) || defined(USART10_BASE)
        {hwDMA_Stream_Index_2, hwDMA_Stream_Index_3},
#endif
};

static const hwDMA_Stream_Index SPI_DMA_Channel_Map[hwSPI_Index_MAX][hwDMA_Peripheral_Direction_MAX] = {
#if defined (SPI1_BASE)
        {hwDMA_Stream_Index_0, hwDMA_Stream_Index_1},
#endif
#if defined (SPI2_BASE)
        {hwDMA_Stream_Index_2, hwDMA_Stream_Index_3},
#endif
#if defined (SPI3_BASE)
        {hwDMA_Stream_Index_4, hwDMA_Stream_Index_5},
#endif
#if defined (SPI4_BASE)
        {hwDMA_Stream_Index_6, hwDMA_Stream_Index_7},
#endif
#if defined (SPI5_BASE)
        {hwDMA_Stream_Index_8, hwDMA_Stream_Index_9},
#endif
#if defined (SPI6_BASE)
        {hwDMA_Stream_Index_16, hwDMA_Stream_Index_17},
#endif
};

static const hwDMA_Stream_Index I2C_DMA_Channel_Map[hwI2C_Index_MAX][hwDMA_Peripheral_Direction_MAX] = {
#if defined (I2C1_BASE)
        {hwDMA_Stream_Index_0, hwDMA_Stream_Index_1},
#endif
#if defined (I2C2_BASE)
        {hwDMA_Stream_Index_2, hwDMA_Stream_Index_3},
#endif
#if defined (I2C3_BASE)
        {hwDMA_Stream_Index_4, hwDMA_Stream_Index_5},
#endif
#if defined (I2C4_BASE)
        {hwDMA_Stream_Index_18, hwDMA_Stream_Index_19},
#endif
};

DMA_TypeDef * DMA_Map_Soc_Base(hwDMA_Stream_Index index)
{
    switch(index)
    {
#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
        case hwDMA_Stream_Index_0:
#endif
#if defined (DMA1_Stream1)
        case hwDMA_Stream_Index_1:
#endif
#if defined (DMA1_Stream2)
        case hwDMA_Stream_Index_2:
#endif
#if defined (DMA1_Stream3)
        case hwDMA_Stream_Index_3:
#endif
#if defined (DMA1_Stream4)
        case hwDMA_Stream_Index_4:
#endif
#if defined (DMA1_Stream5)
        case hwDMA_Stream_Index_5:
#endif
#if defined (DMA1_Stream6)
        case hwDMA_Stream_Index_6:
#endif
#if defined (DMA1_Stream7)
        case hwDMA_Stream_Index_7:
#endif
                return DMA1;
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
        case hwDMA_Stream_Index_8:
#endif
#if defined (DMA2_Stream1)
        case hwDMA_Stream_Index_9:
#endif
#if defined (DMA2_Stream2)
        case hwDMA_Stream_Index_10:
#endif
#if defined (DMA2_Stream3)
        case hwDMA_Stream_Index_11:
#endif
#if defined (DMA2_Stream4)
        case hwDMA_Stream_Index_12:
#endif
#if defined (DMA2_Stream5)
        case hwDMA_Stream_Index_13:
#endif
#if defined (DMA2_Stream6)
        case hwDMA_Stream_Index_14:
#endif
#if defined (DMA2_Stream7)
        case hwDMA_Stream_Index_15:
#endif
                return DMA2;
#endif
        default:
                break;
    }
    return NULL;
}

#if defined (BDMA_BASE)
BDMA_TypeDef * BDMA_Map_Soc_Base(hwDMA_Stream_Index index)
{
    switch(index)
    {
#if defined (BDMA_Channel0)
        case hwDMA_Stream_Index_16:
#endif
#if defined (BDMA_Channel1)
        case hwDMA_Stream_Index_17:
#endif
#if defined (BDMA_Channel2)
        case hwDMA_Stream_Index_18:
#endif
#if defined (BDMA_Channel3)
        case hwDMA_Stream_Index_19:
#endif
#if defined (BDMA_Channel4)
        case hwDMA_Stream_Index_20:
#endif
#if defined (BDMA_Channel5)
        case hwDMA_Stream_Index_21:
#endif
#if defined (BDMA_Channel6)
        case hwDMA_Stream_Index_22:
#endif
#if defined (BDMA_Channel7)
        case hwDMA_Stream_Index_23:
#endif
                return BDMA;
        default:
                break;
    }
    return NULL;
}
#endif //BDMA_BASE

DMA_Stream_TypeDef * DMA_Map_Soc_Stream_Base(hwDMA_Stream_Index index)
{
    switch(index)
    {
#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
        case hwDMA_Stream_Index_0: return DMA1_Stream0;
#endif
#if defined (DMA1_Stream1)
        case hwDMA_Stream_Index_1: return DMA1_Stream1;
#endif
#if defined (DMA1_Stream2)
        case hwDMA_Stream_Index_2: return DMA1_Stream2;
#endif
#if defined (DMA1_Stream3)
        case hwDMA_Stream_Index_3: return DMA1_Stream3;
#endif
#if defined (DMA1_Stream4)
        case hwDMA_Stream_Index_4: return DMA1_Stream4;
#endif
#if defined (DMA1_Stream5)
        case hwDMA_Stream_Index_5: return DMA1_Stream5;
#endif
#if defined (DMA1_Stream6)
        case hwDMA_Stream_Index_6: return DMA1_Stream6;
#endif
#if defined (DMA1_Stream7)
        case hwDMA_Stream_Index_7: return DMA1_Stream7;
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
        case hwDMA_Stream_Index_8: return DMA2_Stream0;
#endif
#if defined (DMA2_Stream1)
        case hwDMA_Stream_Index_9: return DMA2_Stream1;
#endif
#if defined (DMA2_Stream2)
        case hwDMA_Stream_Index_10: return DMA2_Stream2;
#endif
#if defined (DMA2_Stream3)
        case hwDMA_Stream_Index_11: return DMA2_Stream3;
#endif
#if defined (DMA2_Stream4)
        case hwDMA_Stream_Index_12: return DMA2_Stream4;
#endif
#if defined (DMA2_Stream5)
        case hwDMA_Stream_Index_13: return DMA2_Stream5;
#endif
#if defined (DMA2_Stream6)
        case hwDMA_Stream_Index_14: return DMA2_Stream6;
#endif
#if defined (DMA2_Stream7)
        case hwDMA_Stream_Index_15: return DMA2_Stream7;
#endif
#endif
        default: break;
    }
    return NULL;
}

#if defined (BDMA_BASE)
BDMA_Channel_TypeDef * BDMA_Map_Soc_Channel_Base(hwDMA_Stream_Index index)
{
    switch(index)
    {
#if defined (BDMA_Channel0)
        case hwDMA_Stream_Index_16: return BDMA_Channel0;
#endif
#if defined (BDMA_Channel1)
        case hwDMA_Stream_Index_17: return BDMA_Channel1;
#endif
#if defined (BDMA_Channel2)
        case hwDMA_Stream_Index_18: return BDMA_Channel2;
#endif
#if defined (BDMA_Channel3)
        case hwDMA_Stream_Index_19: return BDMA_Channel3;
#endif
#if defined (BDMA_Channel4)
        case hwDMA_Stream_Index_20: return BDMA_Channel4;
#endif
#if defined (BDMA_Channel5)
        case hwDMA_Stream_Index_21: return BDMA_Channel5;
#endif
#if defined (BDMA_Channel6)
        case hwDMA_Stream_Index_22: return BDMA_Channel6;
#endif
#if defined (BDMA_Channel7)
        case hwDMA_Stream_Index_23: return BDMA_Channel7;
#endif
        default: break;
    }
    return NULL;
}
#endif //BDMA_BASE

