neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H7.c
static void DMA_IRQ_Handler(hwDMA_Stream_Index index)
{
        if(index>=hwDMA_Stream_Index_MAX)
        {
                return;
        }

        HAL_DMA_IRQHandler(&g_dma[index]);
}

#if defined (BDMA_BASE)
static void BDMA_IRQ_Handler(hwDMA_Stream_Index index)
{
        if(index>=hwDMA_Stream_Index_MAX)
        {
                return;
        }

        HAL_DMA_IRQHandler(&g_dma[index]);
}
#endif //BDMA_BASE

#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
void DMA1_Stream0_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_0); }
#endif
#if defined (DMA1_Stream1)
void DMA1_Stream1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_1); }
#endif
#if defined (DMA1_Stream2)
void DMA1_Stream2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_2); }
#endif
#if defined (DMA1_Stream3)
void DMA1_Stream3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_3); }
#endif
#if defined (DMA1_Stream4)
void DMA1_Stream4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_4); }
#endif
#if defined (DMA1_Stream5)
void DMA1_Stream5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_5); }
#endif
#if defined (DMA1_Stream6)
void DMA1_Stream6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_6); }
#endif
#if defined (DMA1_Stream7)
void DMA1_Stream7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_7); }
#endif
#endif //DMA1_BASE

#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
void DMA2_Stream0_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_8); }
#endif
#if defined (DMA2_Stream1)
void DMA2_Stream1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_9); }
#endif
#if defined (DMA2_Stream2)
void DMA2_Stream2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_10); }
#endif
#if defined (DMA2_Stream3)
void DMA2_Stream3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_11); }
#endif
#if defined (DMA2_Stream4)
void DMA2_Stream4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_12); }
#endif
#if defined (DMA2_Stream5)
void DMA2_Stream5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_13); }
#endif
#if defined (DMA2_Stream6)
void DMA2_Stream6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_14); }
#endif
#if defined (DMA2_Stream7)
void DMA2_Stream7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Stream_Index_15); }
#endif
#endif //DMA2_BASE

#if defined (BDMA_BASE)
#if defined (BDMA_Channel0)
void BDMA_Channel0_IRQHandler(void){ BDMA_IRQ_Handler(hwDMA_Stream_Index_16); }
#endif
#if defined (BDMA_Channel1)
void BDMA_Channel1_IRQHandler(void){ BDMA_IRQ_Handler(hwDMA_Stream_Index_17); }
#endif
#if defined (BDMA_Channel2)
void BDMA_Channel2_IRQHandler(void){ BDMA_IRQ_Handler(hwDMA_Stream_Index_18); }
#endif
#if defined (BDMA_Channel3)
void BDMA_Channel3_IRQHandler(void){ BDMA_IRQ_Handler(hwDMA_Stream_Index_19); }
#endif
#if defined (BDMA_Channel4)
void BDMA_Channel4_IRQHandler(void){ BDMA_IRQ_Handler(hwDMA_Stream_Index_20); }
#endif
#if defined (BDMA_Channel5)
void BDMA_Channel5_IRQHandler(void){ BDMA_IRQ_Handler(hwDMA_Stream_Index_21); }
#endif
#if defined (BDMA_Channel6)
void BDMA_Channel6_IRQHandler(void){ BDMA_IRQ_Handler(hwDMA_Stream_Index_22); }
#endif
#if defined (BDMA_Channel7)
void BDMA_Channel7_IRQHandler(void){ BDMA_IRQ_Handler(hwDMA_Stream_Index_23); }
#endif
#endif //BDMA_BASE

void DMA_Clock_Enable()
{
#if defined (DMA1_BASE)
         __HAL_RCC_DMA1_CLK_ENABLE();
#endif //DMA1_BASE

#if defined (DMA2_BASE)
        __HAL_RCC_DMA2_CLK_ENABLE();
#endif //DMA2_BASE

#if defined (BDMA_BASE)
        __HAL_RCC_BDMA_CLK_ENABLE();
#endif //BDMA_BASE
}

void DMA_Clock_Disable()
{
#if defined (DMA1_BASE)
        __HAL_RCC_DMA1_CLK_DISABLE();
#endif //DMA1_BASE

#if defined (DMA2_BASE)
        __HAL_RCC_DMA2_CLK_DISABLE();
#endif //DMA2_BASE

#if defined (BDMA_BASE)
        __HAL_RCC_BDMA_CLK_DISABLE();
#endif //BDMA_BASE
}

hwDMA_OpResult DMA_NVIC_Init(hwDMA_Stream_Index stream_index)
{
        if(stream_index>=hwDMA_Stream_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Stream_Init_Status[stream_index]==true)
        {
                return hwDMA_OK;
        }

        switch(stream_index)
        {
#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
                case hwDMA_Stream_Index_0:
                        HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
                        break;
#endif
#if defined (DMA1_Stream1)
                case hwDMA_Stream_Index_1:
                        HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);
                        break;
#endif
#if defined (DMA1_Stream2)
                case hwDMA_Stream_Index_2:
                        HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);
                        break;
#endif
#if defined (DMA1_Stream3)
                case hwDMA_Stream_Index_3:
                        HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
                        break;
#endif
#if defined (DMA1_Stream4)
                case hwDMA_Stream_Index_4:
                        HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);
                        break;
#endif
#if defined (DMA1_Stream5)
                case hwDMA_Stream_Index_5:
                        HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);
                        break;
#endif
#if defined (DMA1_Stream6)
                case hwDMA_Stream_Index_6:
                        HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);
                        break;
#endif
#if defined (DMA1_Stream7)
                case hwDMA_Stream_Index_7:
                        HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);
                        break;
#endif
#endif //DMA1_BASE
#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
                case hwDMA_Stream_Index_8:
                        HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);
                        break;
#endif
#if defined (DMA2_Stream1)
                case hwDMA_Stream_Index_9:
                        HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);
                        break;
#endif
#if defined (DMA2_Stream2)
                case hwDMA_Stream_Index_10:
                        HAL_NVIC_SetPriority(DMA2_Stream2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream2_IRQn);
                        break;
#endif
#if defined (DMA2_Stream3)
                case hwDMA_Stream_Index_11:
                        HAL_NVIC_SetPriority(DMA2_Stream3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);
                        break;
#endif
#if defined (DMA2_Stream4)
                case hwDMA_Stream_Index_12:
                        HAL_NVIC_SetPriority(DMA2_Stream4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream4_IRQn);
                        break;
#endif
#if defined (DMA2_Stream5)
                case hwDMA_Stream_Index_13:
                        HAL_NVIC_SetPriority(DMA2_Stream5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream5_IRQn);
                        break;
#endif
#if defined (DMA2_Stream6)
                case hwDMA_Stream_Index_14:
                        HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);
                        break;
#endif
#if defined (DMA2_Stream7)
                case hwDMA_Stream_Index_15:
                        HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);
                        break;
#endif
#endif //DMA2_BASE
#if defined (BDMA_BASE)
#if defined (BDMA_Channel0)
                case hwDMA_Stream_Index_16:
                        HAL_NVIC_SetPriority(BDMA_Channel0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(BDMA_Channel0_IRQn);
                        break;
#endif
#if defined (BDMA_Channel1)
                case hwDMA_Stream_Index_17:
                        HAL_NVIC_SetPriority(BDMA_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(BDMA_Channel1_IRQn);
                        break;
#endif
#if defined (BDMA_Channel2)
                case hwDMA_Stream_Index_18:
                        HAL_NVIC_SetPriority(BDMA_Channel2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(BDMA_Channel2_IRQn);
                        break;
#endif
#if defined (BDMA_Channel3)
                case hwDMA_Stream_Index_19:
                        HAL_NVIC_SetPriority(BDMA_Channel3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(BDMA_Channel3_IRQn);
                        break;
#endif
#if defined (BDMA_Channel4)
                case hwDMA_Stream_Index_20:
                        HAL_NVIC_SetPriority(BDMA_Channel4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(BDMA_Channel4_IRQn);
                        break;
#endif
#if defined (BDMA_Channel5)
                case hwDMA_Stream_Index_21:
                        HAL_NVIC_SetPriority(BDMA_Channel5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(BDMA_Channel5_IRQn);
                        break;
#endif
#if defined (BDMA_Channel6)
                case hwDMA_Stream_Index_22:
                        HAL_NVIC_SetPriority(BDMA_Channel6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(BDMA_Channel6_IRQn);
                        break;
#endif
#if defined (BDMA_Channel7)
                case hwDMA_Stream_Index_23:
                        HAL_NVIC_SetPriority(BDMA_Channel7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(BDMA_Channel7_IRQn);
                        break;
#endif
#endif //BDMA_BASE
        }

