neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H7.c
        return hwDMA_OK;
}

hwDMA_OpResult DMA_NVIC_DeInit(hwDMA_Stream_Index stream_index)
{
        if(stream_index>=hwDMA_Stream_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        switch(stream_index)
        {
#if defined (DMA1_BASE)
#if defined (DMA1_Stream0)
                case hwDMA_Stream_Index_0:
                        HAL_NVIC_DisableIRQ(DMA1_Stream0_IRQn);
                        break;
#endif
#if defined (DMA1_Stream1)
                case hwDMA_Stream_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Stream1_IRQn);
                        break;
#endif
#if defined (DMA1_Stream2)
                case hwDMA_Stream_Index_2:
                        HAL_NVIC_DisableIRQ(DMA1_Stream2_IRQn);
                        break;
#endif
#if defined (DMA1_Stream3)
                case hwDMA_Stream_Index_3:
                        HAL_NVIC_DisableIRQ(DMA1_Stream3_IRQn);
                        break;
#endif
#if defined (DMA1_Stream4)
                case hwDMA_Stream_Index_4:
                        HAL_NVIC_DisableIRQ(DMA1_Stream4_IRQn);
                        break;
#endif
#if defined (DMA1_Stream5)
                case hwDMA_Stream_Index_5:
                        HAL_NVIC_DisableIRQ(DMA1_Stream5_IRQn);
                        break;
#endif
#if defined (DMA1_Stream6)
                case hwDMA_Stream_Index_6:
                        HAL_NVIC_DisableIRQ(DMA1_Stream6_IRQn);
                        break;
#endif
#if defined (DMA1_Stream7)
                case hwDMA_Stream_Index_7:
                        HAL_NVIC_DisableIRQ(DMA1_Stream7_IRQn);
                        break;
#endif
#endif //DMA1_BASE
#if defined (DMA2_BASE)
#if defined (DMA2_Stream0)
                case hwDMA_Stream_Index_8:
                        HAL_NVIC_DisableIRQ(DMA2_Stream0_IRQn);
                        break;
#endif
#if defined (DMA2_Stream1)
                case hwDMA_Stream_Index_9:
                        HAL_NVIC_DisableIRQ(DMA2_Stream1_IRQn);
                        break;
#endif
#if defined (DMA2_Stream2)
                case hwDMA_Stream_Index_10:
                        HAL_NVIC_DisableIRQ(DMA2_Stream2_IRQn);
                        break;
#endif
#if defined (DMA2_Stream3)
                case hwDMA_Stream_Index_11:
                        HAL_NVIC_DisableIRQ(DMA2_Stream3_IRQn);
                        break;
#endif
#if defined (DMA2_Stream4)
                case hwDMA_Stream_Index_12:
                        HAL_NVIC_DisableIRQ(DMA2_Stream4_IRQn);
                        break;
#endif
#if defined (DMA2_Stream5)
                case hwDMA_Stream_Index_13:
                        HAL_NVIC_DisableIRQ(DMA2_Stream5_IRQn);
                        break;
#endif
#if defined (DMA2_Stream6)
                case hwDMA_Stream_Index_14:
                        HAL_NVIC_DisableIRQ(DMA2_Stream6_IRQn);
                        break;
#endif
#if defined (DMA2_Stream7)
                case hwDMA_Stream_Index_15:
                        HAL_NVIC_DisableIRQ(DMA2_Stream7_IRQn);
                        break;
#endif
#endif //DMA2_BASE
#if defined (BDMA_BASE)
#if defined (BDMA_Channel0)
                case hwDMA_Stream_Index_16:
                        HAL_NVIC_DisableIRQ(BDMA_Channel0_IRQn);
                        break;
#endif
#if defined (BDMA_Channel1)
                case hwDMA_Stream_Index_17:
                        HAL_NVIC_DisableIRQ(BDMA_Channel1_IRQn);
                        break;
#endif
#if defined (BDMA_Channel2)
                case hwDMA_Stream_Index_18:
                        HAL_NVIC_DisableIRQ(BDMA_Channel2_IRQn);
                        break;
#endif
#if defined (BDMA_Channel3)
                case hwDMA_Stream_Index_19:
                        HAL_NVIC_DisableIRQ(BDMA_Channel3_IRQn);
                        break;
#endif
#if defined (BDMA_Channel4)
                case hwDMA_Stream_Index_20:
                        HAL_NVIC_DisableIRQ(BDMA_Channel4_IRQn);
                        break;
#endif
#if defined (BDMA_Channel5)
                case hwDMA_Stream_Index_21:
                        HAL_NVIC_DisableIRQ(BDMA_Channel5_IRQn);
                        break;
#endif
#if defined (BDMA_Channel6)
                case hwDMA_Stream_Index_22:
                        HAL_NVIC_DisableIRQ(BDMA_Channel6_IRQn);
                        break;
#endif
#if defined (BDMA_Channel7)
                case hwDMA_Stream_Index_23:
                        HAL_NVIC_DisableIRQ(BDMA_Channel7_IRQn);
                        break;
#endif
#endif //BDMA_BASE
        }

        return hwDMA_OK;
}

static void* DMA_Get_Instance(hwDMA_Stream_Index stream_index)
{
    DMA_Stream_TypeDef *dma_soc_stream_base = NULL;
    BDMA_Channel_TypeDef *bdma_soc_channel_base = NULL;

    if (stream_index >= hwDMA_Stream_Index_MAX)
    {
        return NULL;
    }

    if (stream_index < hwDMA_Stream_Index_16)
    {
        dma_soc_stream_base = DMA_Map_Soc_Stream_Base(stream_index);
        if (dma_soc_stream_base == NULL)
        {
            return NULL;
        }

        return dma_soc_stream_base;
    }
    else if (stream_index >= hwDMA_Stream_Index_16 && stream_index < hwDMA_Stream_Index_MAX)
    {
        bdma_soc_channel_base = BDMA_Map_Soc_Channel_Base(stream_index);
        if (bdma_soc_channel_base == NULL)
        {
            return NULL;
        }

        return bdma_soc_channel_base;
    }
    else
    {
        return NULL;
    }
}

static hwDMA_OpResult DMA_DeConfig(hwDMA_Stream_Index stream_index)
{
    if (stream_index >= hwDMA_Stream_Index_MAX)
    {
        return hwDMA_InvalidParameter;
    }

    if (DMA_Stream_Init_Status[stream_index] == false)
    {
        return hwDMA_NotInit;
    }

    if (g_dma[stream_index].Instance != NULL)
    {
        HAL_DMA_Abort(&g_dma[stream_index]);

        if (HAL_DMA_DeInit(&g_dma[stream_index]) != HAL_OK)
        {
            return hwDMA_HwError;
        }
    }

    memset(&g_dma[stream_index], 0, sizeof(DMA_HandleTypeDef));

    return hwDMA_OK;
}

static hwDMA_OpResult DMA_Config_UART(hwDMA_Stream_Index stream_index, hwDMA_Peripheral_Direction dir, hwUART_Index index)
{
        if(dir>=hwDMA_Peripheral_Direction_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(stream_index>=hwDMA_Stream_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(index>=hwUART_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

