neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H7.c
        if (DMA_Stream_Init_Status[stream_index] == false)
        {
                return hwDMA_NotInit;
        }

        g_dma[stream_index].Instance = DMA_Get_Instance(stream_index);
        if (g_dma[stream_index].Instance == NULL)
        {
                return hwDMA_InvalidParameter;
        }

        g_dma[stream_index].Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
        g_dma[stream_index].Init.MemBurst            = DMA_MBURST_SINGLE;
        g_dma[stream_index].Init.PeriphBurst         = DMA_PBURST_SINGLE;
        g_dma[stream_index].Init.PeriphInc           = DMA_PINC_DISABLE;
        g_dma[stream_index].Init.MemInc              = DMA_MINC_ENABLE;
        g_dma[stream_index].Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        g_dma[stream_index].Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
        g_dma[stream_index].Init.Mode                = DMA_NORMAL;
        g_dma[stream_index].Init.Priority            = DMA_PRIORITY_HIGH;

        switch (dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        g_dma[stream_index].Init.Direction = DMA_MEMORY_TO_PERIPH;

                        switch (index)
                        {
#if defined (UART1_BASE)
                                case hwUART_Index_0:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART1_TX;
                                        break;
#endif
#if defined(USART1_BASE)
                                case hwUART_Index_0:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART1_TX;
                                        break;
#endif
#if defined (UART2_BASE)
                                case hwUART_Index_1:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART2_TX;
                                        break;
#endif
#if defined(USART2_BASE)
                                case hwUART_Index_1:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART2_TX;
                                        break;
#endif
#if defined (UART3_BASE)
                                case hwUART_Index_2:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART3_TX;
                                        break;
#endif
#if defined(USART3_BASE)
                                case hwUART_Index_2:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART3_TX;
                                        break;
#endif
#if defined (UART4_BASE)
                                case hwUART_Index_3:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART4_TX;
                                        break;
#endif
#if defined(USART4_BASE)
                                case hwUART_Index_3:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART4_TX;
                                        break;
#endif
#if defined (UART5_BASE)
                                case hwUART_Index_4:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART5_TX;
                                        break;
#endif
#if defined(USART5_BASE)
                                case hwUART_Index_4:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART5_TX;
                                        break;
#endif
#if defined (UART6_BASE)
                                case hwUART_Index_5:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART6_TX;
                                        break;
#endif
#if defined(USART6_BASE)
                                case hwUART_Index_5:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART6_TX;
                                        break;
#endif
#if defined (UART7_BASE)
                                case hwUART_Index_6:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART7_TX;
                                        break;
#endif
#if defined(USART7_BASE)
                                case hwUART_Index_6:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART7_TX;
                                        break;
#endif
#if defined (UART8_BASE)
                                case hwUART_Index_7:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART8_TX;
                                        break;
#endif
#if defined(USART8_BASE)
                                case hwUART_Index_7:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART8_TX;
                                        break;
#endif
#if defined (UART9_BASE)
                                case hwUART_Index_8:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART9_TX;
                                        break;
#endif
#if defined(USART9_BASE)
                                case hwUART_Index_8:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART9_TX;
                                        break;
#endif
#if defined (UART10_BASE)
                                case hwUART_Index_9:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_UART10_TX;
                                        break;
#endif
#if defined(USART10_BASE)
                                case hwUART_Index_9:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_USART10_TX;
                                        break;
#endif
#if defined(LPUART1_BASE)
                                case hwUART_Index_L1:
                                        g_dma[stream_index].Init.Request = BDMA_REQUEST_LPUART1_TX;
                                        break;
#endif
                        }
                        break;

                case hwDMA_Peripheral_Direction_RX:
                        g_dma[stream_index].Init.Direction = DMA_PERIPH_TO_MEMORY;

