neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H7.c
                        switch (index)
                        {
#if defined (I2C1_BASE)
                                case hwI2C_Index_0:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_I2C1_TX;
                                        break;
#endif
#if defined (I2C2_BASE)
                                case hwI2C_Index_1:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_I2C2_TX;
                                        break;
#endif
#if defined (I2C3_BASE)
                                case hwI2C_Index_2:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_I2C3_TX;
                                        break;
#endif
#if defined (I2C4_BASE)
                                case hwI2C_Index_3:
                                        g_dma[stream_index].Init.Request = BDMA_REQUEST_I2C4_TX;
                                        break;
#endif
                        }
                        break;

                case hwDMA_Peripheral_Direction_RX:
                        g_dma[stream_index].Init.Direction = DMA_PERIPH_TO_MEMORY;

                        switch (index)
                        {
#if defined (I2C1_BASE)
                                case hwI2C_Index_0:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_I2C1_RX;
                                        break;
#endif
#if defined (I2C2_BASE)
                                case hwI2C_Index_1:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_I2C2_RX;
                                        break;
#endif
#if defined (I2C3_BASE)
                                case hwI2C_Index_2:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_I2C3_RX;
                                        break;
#endif
#if defined (I2C4_BASE)
                                case hwI2C_Index_3:
                                        g_dma[stream_index].Init.Request = BDMA_REQUEST_I2C4_RX;
                                        break;
#endif
                        }
                        break;
        }

        if (HAL_DMA_Init(&g_dma[stream_index]) != HAL_OK)
        {
                return hwDMA_HwError;
        }

        switch (dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                __HAL_LINKDMA(&g_i2c[index], hdmatx, g_dma[stream_index]);
                break;

                case hwDMA_Peripheral_Direction_RX:
                __HAL_LINKDMA(&g_i2c[index], hdmarx, g_dma[stream_index]);
                break;

                default:
                return hwDMA_InvalidParameter;
        }

        return hwDMA_OK;
}

static hwDMA_OpResult DMA_Config_SPI(hwDMA_Stream_Index stream_index, hwDMA_Peripheral_Direction dir, hwSPI_Index index)
{
        if(dir>=hwDMA_Peripheral_Direction_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(stream_index>=hwDMA_Stream_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(index>=hwSPI_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Stream_Init_Status[stream_index]==false)
        {
                return hwDMA_NotInit;
        }

        g_dma[stream_index].Instance = DMA_Get_Instance(stream_index);
        if(g_dma[stream_index].Instance == NULL)
        {
                return hwDMA_InvalidParameter;
        }

        g_dma[stream_index].Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
        g_dma[stream_index].Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
        g_dma[stream_index].Init.MemBurst            = DMA_MBURST_SINGLE;
        g_dma[stream_index].Init.PeriphBurst         = DMA_PBURST_SINGLE;
        g_dma[stream_index].Init.PeriphInc           = DMA_PINC_DISABLE;
        g_dma[stream_index].Init.MemInc              = DMA_MINC_ENABLE;
        g_dma[stream_index].Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        g_dma[stream_index].Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
        g_dma[stream_index].Init.Mode                = DMA_NORMAL;
        g_dma[stream_index].Init.Priority            = DMA_PRIORITY_HIGH;

        switch(dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        g_dma[stream_index].Init.Direction = DMA_MEMORY_TO_PERIPH;
                        switch(index)
                        {
#if defined (SPI1_BASE)
                                case hwSPI_Index_0:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI1_TX;
                                        break;
#endif
#if defined (SPI2_BASE)
                                case hwSPI_Index_1:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI2_TX;
                                        break;
#endif
#if defined (SPI3_BASE)
                                case hwSPI_Index_2:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI3_TX;
                                        break;
#endif
#if defined (SPI4_BASE)
                                case hwSPI_Index_3:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI4_TX;
                                        break;
#endif
#if defined (SPI5_BASE)
                                case hwSPI_Index_4:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI5_TX;
                                        break;
#endif
#if defined (SPI6_BASE)
                                case hwSPI_Index_5:
                                        g_dma[stream_index].Init.Request = BDMA_REQUEST_SPI6_TX;
                                        break;
#endif
                        }
                        break;
                case hwDMA_Peripheral_Direction_RX:
                        g_dma[stream_index].Init.Direction = DMA_PERIPH_TO_MEMORY;
                        switch(index)
                        {
#if defined (SPI1_BASE)
                                case hwSPI_Index_0:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI1_RX;
                                        break;
#endif
#if defined (SPI2_BASE)
                                case hwSPI_Index_1:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI2_RX;
                                        break;
#endif
#if defined (SPI3_BASE)
                                case hwSPI_Index_2:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI3_RX;
                                        break;
#endif
#if defined (SPI4_BASE)
                                case hwSPI_Index_3:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI4_RX;
                                        break;
#endif
#if defined (SPI5_BASE)
                                case hwSPI_Index_4:
                                        g_dma[stream_index].Init.Request = DMA_REQUEST_SPI5_RX;
                                        break;
#endif
#if defined (SPI6_BASE)
                                case hwSPI_Index_5:
                                        g_dma[stream_index].Init.Request = BDMA_REQUEST_SPI6_RX;
                                        break;
#endif
                        }
                        break;
        }

        if (HAL_DMA_Init(&g_dma[stream_index]) != HAL_OK)
        {
                return hwDMA_HwError;
        }

        switch(dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        __HAL_LINKDMA(&g_spi[index], hdmatx, g_dma[stream_index]);
                        break;
                case hwDMA_Peripheral_Direction_RX:
                        __HAL_LINKDMA(&g_spi[index], hdmarx, g_dma[stream_index]);
                        break;
        }

